// Generated by jextract

package pe.pi.v4l2reader.mediaApi;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct media_link {
 *     struct media_pad *source;
 *     struct media_pad *sink;
 *     struct media_link *twin;
 *     __u32 flags;
 *     __u32 padding[3];
 * }
 * }
 */
public class media_link {

    media_link() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        mediaAPI.C_POINTER.withName("source"),
        mediaAPI.C_POINTER.withName("sink"),
        mediaAPI.C_POINTER.withName("twin"),
        mediaAPI.C_INT.withName("flags"),
        MemoryLayout.sequenceLayout(3, mediaAPI.C_INT).withName("padding")
    ).withName("media_link");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout source$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("source"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct media_pad *source
     * }
     */
    public static final AddressLayout source$layout() {
        return source$LAYOUT;
    }

    private static final long source$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct media_pad *source
     * }
     */
    public static final long source$offset() {
        return source$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct media_pad *source
     * }
     */
    public static MemorySegment source(MemorySegment struct) {
        return struct.get(source$LAYOUT, source$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct media_pad *source
     * }
     */
    public static void source(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(source$LAYOUT, source$OFFSET, fieldValue);
    }

    private static final AddressLayout sink$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("sink"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct media_pad *sink
     * }
     */
    public static final AddressLayout sink$layout() {
        return sink$LAYOUT;
    }

    private static final long sink$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct media_pad *sink
     * }
     */
    public static final long sink$offset() {
        return sink$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct media_pad *sink
     * }
     */
    public static MemorySegment sink(MemorySegment struct) {
        return struct.get(sink$LAYOUT, sink$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct media_pad *sink
     * }
     */
    public static void sink(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(sink$LAYOUT, sink$OFFSET, fieldValue);
    }

    private static final AddressLayout twin$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("twin"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct media_link *twin
     * }
     */
    public static final AddressLayout twin$layout() {
        return twin$LAYOUT;
    }

    private static final long twin$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct media_link *twin
     * }
     */
    public static final long twin$offset() {
        return twin$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct media_link *twin
     * }
     */
    public static MemorySegment twin(MemorySegment struct) {
        return struct.get(twin$LAYOUT, twin$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct media_link *twin
     * }
     */
    public static void twin(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(twin$LAYOUT, twin$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final SequenceLayout padding$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("padding"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 padding[3]
     * }
     */
    public static final SequenceLayout padding$layout() {
        return padding$LAYOUT;
    }

    private static final long padding$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 padding[3]
     * }
     */
    public static final long padding$offset() {
        return padding$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 padding[3]
     * }
     */
    public static MemorySegment padding(MemorySegment struct) {
        return struct.asSlice(padding$OFFSET, padding$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 padding[3]
     * }
     */
    public static void padding(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, padding$OFFSET, padding$LAYOUT.byteSize());
    }

    private static long[] padding$DIMS = { 3 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __u32 padding[3]
     * }
     */
    public static long[] padding$dimensions() {
        return padding$DIMS;
    }
    private static final VarHandle padding$ELEM_HANDLE = padding$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * __u32 padding[3]
     * }
     */
    public static int padding(MemorySegment struct, long index0) {
        return (int)padding$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * __u32 padding[3]
     * }
     */
    public static void padding(MemorySegment struct, long index0, int fieldValue) {
        padding$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

